Revit 2027 API
BuiltInFailures.OverlapFailures.SubregionOverlap Property
 Highlighted sub-division overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SubregionOverlap { get; }
Public Shared ReadOnly Property SubregionOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SubregionOverlap {
	FailureDefinitionId^ get ();
}
static member SubregionOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace